# Books Core
Jacob Wang
12/17/2022

# ERD Diagram

 ![png](booksERD.png)

# Add data to tables

In [3]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pandas as pd
import numpy as np

In [10]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:Airmax#90@localhost/books"
create_database(connection)

In [11]:
engine = create_engine(connection)

In [5]:
df_books = pd.read_csv('books.csv')
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [12]:
df_books.to_sql('books', engine, if_exists = 'replace')

6

In [13]:
df_users = pd.read_csv('users.csv')
df_faves = pd.read_csv('favorites.csv')
df_authors = pd.read_csv('authors.csv')

In [14]:
df_users.to_sql('users', engine, if_exists = 'replace')
df_faves.to_sql('favorites', engine, if_exists = 'replace')
df_authors.to_sql('authors', engine, if_exists = 'replace')

5

In [15]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [16]:
q = """
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));

"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1